codeigniterlı template/codeIgniter4/app/Controllers/User.php

SELECT *
FROM `seferler`
WHERE `Kalkis_sehir` = '34'
AND `Varis_sehir` = '6'
AND `Tarih` = '2024-03-29'
---
public function seferler()
{
    $session=session();
    if( $session->has('user') )
    {
    $model = new UserModelSeferler();
        $results = $model->where('Kalkis_sehir', $this->request->getVar('sehirNereden'))
                        ->where('Varis_sehir', $this->request->getVar('sehirNereye'))
                        ->where('Tarih', $this->request->getVar('departure-date'))
                        ->findAll();

SELECT *
FROM `seferler`
WHERE `Sefer_id` = '37'
 LIMIT 1
---
        $result = $this->db->query($query, [$session->user["Yolcu_id"],$yol,$koltuk]);

        $seferModel=new UserModelSeferler();
        $sseferId=$seferModel->where('Sefer_id',$yol)->first();