codeigniterlı template/codeIgniter4/app/Views/biletlerim.php

            <?php
            use App\Models\UserModelBiletLogView;
            $biletLogViewModel=new UserModelBiletLogView();
            $biletLogViews=$biletLogViewModel->where('Yolcu_Ad',$session->user["Ad"])->where('Yolcu_Soyad',$session->user["Soyad"])->findAll();
---
SELECT *
FROM `bilet_log_view`
WHERE `Yolcu_Ad` = 'Admin'
AND `Yolcu_Soyad` = 'admin'