codeigniterlı template/codeIgniter4/app/Views/buyTicket.php

SELECT *
FROM `sehirler`
---
                                                <?php
                                                use App\Models\UserModelSehirler;
                                                $sehirModel = new UserModelSehirler();
                                                $sehirler = $sehirModel->findAll();