codeigniterlı template/codeIgniter4/app/Views/seferekle.php

            <?php
                use App\Models\UserModelSehirler;
                $sehirModel = new UserModelSehirler();
                $sehirler = $sehirModel->findAll();
---
SELECT *
FROM `sehirler`